{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [],
  "normalizer": {
    "type": "Sequence",
    "normalizers": [
      {
        "type": "Lowercase"
      },
      {
        "type": "StripAccents"
      }
    ]
  },
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "a": 5,
      "b": 6,
      "c": 7,
      "d": 8,
      "e": 9,
      "f": 10,
      "g": 11,
      "h": 12,
      "i": 13,
      "j": 14,
      "k": 15,
      "l": 16,
      "m": 17,
      "n": 18,
      "o": 19,
      "p": 20,
      "q": 21,
      "r": 22,
      "s": 23,
      "t": 24,
      "u": 25,
      "v": 26,
      "w": 27,
      "x": 28,
      "y": 29,
      "z": 30,
      "0": 31,
      "1": 32,
      "2": 33,
      "3": 34,
      "4": 35,
      "5": 36,
      "6": 37,
      "7": 38,
      "8": 39,
      "9": 40,
      " ": 41,
      ".": 42,
      ",": 43,
      ";": 44,
      ":": 45,
      "!": 46,
      "?": 47,
      "-": 48,
      "'": 49,
      "\"": 50,
      "(": 51,
      ")": 52,
      "[": 53,
      "]": 54,
      "{": 55,
      "}": 56,
      "/": 57,
      "@": 58,
      "#": 59,
      "$": 60,
      "%": 61,
      "^": 62,
      "&": 63,
      "*": 64,
      "+": 65,
      "=": 66,
      "<": 67,
      ">": 68,
      "~": 69,
      "`": 70,
      "_": 71,
      "\\": 72,
      "|": 73,
      "the": 74,
      "is": 75,
      "an": 76,
      "of": 77,
      "in": 78,
      "to": 79,
      "and": 80,
      "for": 81,
      "on": 82,
      "with": 83,
      "this": 84,
      "that": 85,
      "we": 86,
      "our": 87,
      "new": 88,
      "from": 89,
      "by": 90,
      "at": 91,
      "are": 92,
      "as": 93,
      "be": 94,
      "or": 95,
      "not": 96,
      "it": 97,
      "can": 98,
      "has": 99,
      "was": 100,
      "but": 101,
      "all": 102,
      "its": 103,
      "one": 104,
      "two": 105,
      "more": 106,
      "use": 107,
      "been": 108,
      "will": 109,
      "each": 110,
      "about": 111,
      "how": 112,
      "up": 113,
      "out": 114,
      "if": 115,
      "do": 116,
      "no": 117,
      "so": 118,
      "what": 119,
      "when": 120,
      "quantum": 121,
      "model": 122,
      "data": 123,
      "error": 124,
      "test": 125,
      "patent": 126,
      "method": 127,
      "system": 128,
      "using": 129,
      "based": 130,
      "learning": 131,
      "network": 132,
      "neural": 133,
      "approach": 134,
      "results": 135,
      "novel": 136,
      "present": 137,
      "structure": 138,
      "high": 139,
      "energy": 140,
      "cell": 141,
      "protein": 142,
      "gene": 143,
      "surface": 144,
      "design": 145,
      "##s": 146,
      "##ed": 147,
      "##ing": 148,
      "##er": 149,
      "##ly": 150,
      "##tion": 151,
      "##al": 152,
      "##ment": 153,
      "##ive": 154,
      "##ous": 155,
      "##ity": 156,
      "##ness": 157,
      "##able": 158,
      "##ful": 159,
      "##less": 160,
      "##ize": 161,
      "##ical": 162,
      "##ence": 163,
      "##ance": 164,
      "[unused165]": 165,
      "[unused166]": 166,
      "[unused167]": 167,
      "[unused168]": 168,
      "[unused169]": 169,
      "[unused170]": 170,
      "[unused171]": 171,
      "[unused172]": 172,
      "[unused173]": 173,
      "[unused174]": 174,
      "[unused175]": 175,
      "[unused176]": 176,
      "[unused177]": 177,
      "[unused178]": 178,
      "[unused179]": 179,
      "[unused180]": 180,
      "[unused181]": 181,
      "[unused182]": 182,
      "[unused183]": 183,
      "[unused184]": 184,
      "[unused185]": 185,
      "[unused186]": 186,
      "[unused187]": 187,
      "[unused188]": 188,
      "[unused189]": 189,
      "[unused190]": 190,
      "[unused191]": 191,
      "[unused192]": 192,
      "[unused193]": 193,
      "[unused194]": 194,
      "[unused195]": 195,
      "[unused196]": 196,
      "[unused197]": 197,
      "[unused198]": 198,
      "[unused199]": 199,
      "[unused200]": 200,
      "[unused201]": 201,
      "[unused202]": 202,
      "[unused203]": 203,
      "[unused204]": 204,
      "[unused205]": 205,
      "[unused206]": 206,
      "[unused207]": 207,
      "[unused208]": 208,
      "[unused209]": 209,
      "[unused210]": 210,
      "[unused211]": 211,
      "[unused212]": 212,
      "[unused213]": 213,
      "[unused214]": 214,
      "[unused215]": 215,
      "[unused216]": 216,
      "[unused217]": 217,
      "[unused218]": 218,
      "[unused219]": 219,
      "[unused220]": 220,
      "[unused221]": 221,
      "[unused222]": 222,
      "[unused223]": 223,
      "[unused224]": 224,
      "[unused225]": 225,
      "[unused226]": 226,
      "[unused227]": 227,
      "[unused228]": 228,
      "[unused229]": 229,
      "[unused230]": 230,
      "[unused231]": 231,
      "[unused232]": 232,
      "[unused233]": 233,
      "[unused234]": 234,
      "[unused235]": 235,
      "[unused236]": 236,
      "[unused237]": 237,
      "[unused238]": 238,
      "[unused239]": 239,
      "[unused240]": 240,
      "[unused241]": 241,
      "[unused242]": 242,
      "[unused243]": 243,
      "[unused244]": 244,
      "[unused245]": 245,
      "[unused246]": 246,
      "[unused247]": 247,
      "[unused248]": 248,
      "[unused249]": 249,
      "[unused250]": 250,
      "[unused251]": 251,
      "[unused252]": 252,
      "[unused253]": 253,
      "[unused254]": 254,
      "[unused255]": 255
    }
  }
}