{
  "architectures": [
    "BertModel"
  ],
  "model_type": "bert",
  "hidden_size": 32,
  "num_hidden_layers": 1,
  "num_attention_heads": 2,
  "intermediate_size": 128,
  "vocab_size": 256,
  "max_position_embeddings": 128,
  "type_vocab_size": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "attention_probs_dropout_prob": 0.0,
  "layer_norm_eps": 1e-12,
  "initializer_range": 0.02,
  "position_embedding_type": "absolute",
  "pad_token_id": 0
}